[
  {
    "text": "The exile returned not for peace, but for reckoning under a blood moon.",
    "label": "Revenge"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life after centuries of silence.",
    "label": "Quest"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean.",
    "label": "Love Story"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals in secret.",
    "label": "Science"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests in secret.",
    "label": "Quest"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air guided by dreams.",
    "label": "Mystery"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal after centuries of silence.",
    "label": "Revenge"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals before the eclipse.",
    "label": "Science"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air.",
    "label": "Mystery"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life guided by dreams.",
    "label": "Quest"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air after centuries of silence.",
    "label": "Mystery"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact.",
    "label": "Quest"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark guided by dreams.",
    "label": "Revenge"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy before the eclipse.",
    "label": "Science"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return after centuries of silence.",
    "label": "Love Story"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air under a blood moon.",
    "label": "Mystery"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war.",
    "label": "Love Story"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark under a blood moon.",
    "label": "Revenge"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight in secret.",
    "label": "Mystery"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return.",
    "label": "Love Story"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return after centuries of silence.",
    "label": "Love Story"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time.",
    "label": "Discovery"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean under a blood moon.",
    "label": "Love Story"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal.",
    "label": "Revenge"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact guided by dreams.",
    "label": "Quest"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something... moving.",
    "label": "Science"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world after centuries of silence.",
    "label": "Discovery"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact before the eclipse.",
    "label": "Quest"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact before the eclipse.",
    "label": "Quest"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests under a blood moon.",
    "label": "Quest"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world before the eclipse.",
    "label": "Discovery"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight guided by dreams.",
    "label": "Mystery"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something after centuries of silence. after centuries of silence. after centuries of silence. moving after centuries of silence.",
    "label": "Science"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something before the eclipse. before the eclipse. before the eclipse. moving before the eclipse.",
    "label": "Science"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before in secret.",
    "label": "Discovery"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war under a blood moon.",
    "label": "Love Story"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal under a blood moon.",
    "label": "Revenge"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean guided by dreams.",
    "label": "Love Story"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight before the eclipse.",
    "label": "Mystery"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests after centuries of silence.",
    "label": "Quest"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy after centuries of silence.",
    "label": "Science"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before guided by dreams.",
    "label": "Discovery"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world guided by dreams.",
    "label": "Discovery"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight under a blood moon.",
    "label": "Mystery"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy after centuries of silence.",
    "label": "Science"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal before the eclipse.",
    "label": "Revenge"
  },
  {
    "text": "The exile returned not for peace, but for reckoning under a blood moon.",
    "label": "Revenge"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world.",
    "label": "Discovery"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life before the eclipse.",
    "label": "Quest"
  },
  {
    "text": "Every mirror in the mansion reflected something guided by dreams. guided by dreams. guided by dreams. else guided by dreams.",
    "label": "Mystery"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals in secret.",
    "label": "Science"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life guided by dreams.",
    "label": "Quest"
  },
  {
    "text": "The exile returned not for peace, but for reckoning guided by dreams.",
    "label": "Revenge"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact under a blood moon.",
    "label": "Quest"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time in secret.",
    "label": "Discovery"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean in secret.",
    "label": "Love Story"
  },
  {
    "text": "Every mirror in the mansion reflected something guided by dreams. guided by dreams. guided by dreams. else guided by dreams.",
    "label": "Mystery"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something guided by dreams. guided by dreams. guided by dreams. moving guided by dreams.",
    "label": "Science"
  },
  {
    "text": "The exile returned not for peace, but for reckoning before the eclipse.",
    "label": "Revenge"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark.",
    "label": "Revenge"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life before the eclipse.",
    "label": "Quest"
  },
  {
    "text": "The adventurer scaled frozen mountains to retrieve the lost artifact after centuries of silence.",
    "label": "Quest"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before.",
    "label": "Discovery"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals.",
    "label": "Science"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air in secret.",
    "label": "Mystery"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time before the eclipse.",
    "label": "Discovery"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean guided by dreams.",
    "label": "Love Story"
  },
  {
    "text": "The poet wrote letters every day to a lover lost across the ocean before the eclipse.",
    "label": "Love Story"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something under a blood moon. under a blood moon. under a blood moon. moving under a blood moon.",
    "label": "Science"
  },
  {
    "text": "Every mirror in the mansion reflected something under a blood moon. under a blood moon. under a blood moon. else under a blood moon.",
    "label": "Mystery"
  },
  {
    "text": "Every mirror in the mansion reflected something in secret. in secret. in secret. else in secret.",
    "label": "Mystery"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy before the eclipse.",
    "label": "Science"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy after centuries of silence.",
    "label": "Science"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal after centuries of silence.",
    "label": "Revenge"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark after centuries of silence.",
    "label": "Revenge"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark in secret.",
    "label": "Revenge"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world in secret.",
    "label": "Discovery"
  },
  {
    "text": "Every mirror in the mansion reflected something before the eclipse. before the eclipse. before the eclipse. else before the eclipse.",
    "label": "Mystery"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return guided by dreams.",
    "label": "Love Story"
  },
  {
    "text": "The exile returned not for peace, but for reckoning.",
    "label": "Revenge"
  },
  {
    "text": "He sharpened the blade every night, remembering the betrayal under a blood moon.",
    "label": "Revenge"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war after centuries of silence.",
    "label": "Love Story"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war in secret.",
    "label": "Love Story"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war after centuries of silence.",
    "label": "Love Story"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests in secret.",
    "label": "Quest"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before before the eclipse.",
    "label": "Discovery"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight.",
    "label": "Mystery"
  },
  {
    "text": "Two strangers found each other on opposite sides of a civil war under a blood moon.",
    "label": "Love Story"
  },
  {
    "text": "They pointed their telescope at the dark sky and found something guided by dreams. guided by dreams. guided by dreams. moving guided by dreams.",
    "label": "Science"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals in secret.",
    "label": "Science"
  },
  {
    "text": "The young physicist built a machine to decode cosmic signals guided by dreams.",
    "label": "Science"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time under a blood moon.",
    "label": "Discovery"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return before the eclipse.",
    "label": "Love Story"
  },
  {
    "text": "Beneath the abandoned city, they found a doorway to another world before the eclipse.",
    "label": "Discovery"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests before the eclipse.",
    "label": "Quest"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time guided by dreams.",
    "label": "Discovery"
  },
  {
    "text": "A detective found footprints that led nowhere, vanishing in thin air in secret.",
    "label": "Mystery"
  },
  {
    "text": "A traveler crossed deserts for a relic said to bring eternal life.",
    "label": "Quest"
  },
  {
    "text": "In her underground lab, the chemist discovered a formula for limitless energy.",
    "label": "Science"
  },
  {
    "text": "She waited by the same tree every year, hoping he'd return after centuries of silence.",
    "label": "Love Story"
  },
  {
    "text": "The exile returned not for peace, but for reckoning in secret.",
    "label": "Revenge"
  },
  {
    "text": "Every mirror in the mansion reflected something... else.",
    "label": "Mystery"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before before the eclipse.",
    "label": "Discovery"
  },
  {
    "text": "Mapping forgotten lands, the explorers stumbled upon a civilization untouched by time after centuries of silence.",
    "label": "Discovery"
  },
  {
    "text": "The old library whispered secrets to anyone who stayed past midnight after centuries of silence.",
    "label": "Mystery"
  },
  {
    "text": "Justice would come not from courts, but from cold hands in the dark after centuries of silence.",
    "label": "Revenge"
  },
  {
    "text": "The knight set out at dawn, his map leading him deep into forbidden forests.",
    "label": "Quest"
  },
  {
    "text": "A diver uncovered a shipwreck filled with artifacts never seen before in secret.",
    "label": "Discovery"
  }
]