{
  "word_to_idx": {
    "her": 4,
    "hands": 5,
    "felt": 6,
    "warm": 7,
    "wrapped": 8,
    "around": 9,
    "the": 10,
    "mug": 11,
    "of": 12,
    "freshly": 13,
    "brewed": 14,
    "coffee": 15,
    "elderly": 16,
    "couple": 17,
    "seemed": 18,
    "content": 19,
    "sitting": 20,
    "together": 21,
    "not": 22,
    "needing": 23,
    "to": 24,
    "speak": 25,
    "recipe": 26,
    "was": 27,
    "simple": 28,
    "requiring": 29,
    "only": 30,
    "five": 31,
    "common": 32,
    "ingredients": 33,
    "their": 34,
    "shelter": 35,
    "provided": 36,
    "basic": 37,
    "protection": 38,
    "from": 39,
    "elements": 40,
    "but": 41,
    "little": 42,
    "comfort": 43,
    "he": 44,
    "wanted": 45,
    "something": 46,
    "tangible": 47,
    "remember": 48,
    "his": 49,
    "journey": 50,
    "just": 51,
    "digital": 52,
    "photos": 53,
    "offered": 54,
    "practical": 55,
    "advice": 56,
    "based": 57,
    "on": 58,
    "years": 59,
    "experience": 60,
    "in": 61,
    "field": 62,
    "a": 63,
    "cool": 64,
    "breeze": 65,
    "rustled": 66,
    "leaves": 67,
    "as": 68,
    "they": 69,
    "sat": 70,
    "porch": 71,
    "empty": 72,
    "playground": 73,
    "had": 74,
    "melancholy": 75,
    "atmosphere": 76,
    "fading": 77,
    "evening": 78,
    "light": 79,
    "despair": 80,
    "overwhelmed": 81,
    "refugees": 82,
    "faced": 83,
    "another": 84,
    "winter": 85,
    "without": 86,
    "adequate": 87,
    "movie": 88,
    "s": 89,
    "ending": 90,
    "left": 91,
    "everyone": 92,
    "theater": 93,
    "feeling": 94,
    "sad": 95,
    "and": 96,
    "reflective": 97,
    "project": 98,
    "moderate": 99,
    "complexity": 100,
    "team": 101,
    "specialists": 102,
    "novel": 103,
    "presented": 104,
    "complex": 105,
    "narrative": 106,
    "with": 107,
    "multiple": 108,
    "timelines": 109,
    "perspectives": 110,
    "children": 111,
    "were": 112,
    "happy": 113,
    "laughing": 114,
    "chased": 115,
    "each": 116,
    "other": 117,
    "through": 118,
    "sprinklers": 119,
    "painting": 120,
    "used": 121,
    "abstract": 122,
    "shapes": 123,
    "colors": 124,
    "evoke": 125,
    "emotional": 126,
    "responses": 127,
    "exam": 128,
    "tested": 129,
    "knowledge": 130,
    "subject": 131,
    "neither": 132,
    "too": 133,
    "easy": 134,
    "nor": 135,
    "difficult": 136,
    "mild": 137,
    "summer": 138,
    "perfect": 139,
    "for": 140,
    "dining": 141,
    "outside": 142,
    "course": 143,
    "covered": 144,
    "concepts": 145,
    "that": 146,
    "would": 147,
    "form": 148,
    "foundation": 149,
    "advanced": 150,
    "studies": 151,
    "ancient": 152,
    "city": 153,
    "labyrinthine": 154,
    "streets": 155,
    "confused": 156,
    "even": 157,
    "longtime": 158,
    "residents": 159,
    "skin": 160,
    "burning": 161,
    "after": 162,
    "many": 163,
    "hours": 164,
    "at": 165,
    "beach": 166,
    "sunscreen": 167,
    "hard": 168,
    "climb": 169,
    "summit": 170,
    "enjoying": 171,
    "view": 172,
    "gathered": 173,
    "fireplace": 174,
    "sharing": 175,
    "stories": 176,
    "late": 177,
    "into": 178,
    "night": 179,
    "breath": 180,
    "formed": 181,
    "visible": 182,
    "clouds": 183,
    "cold": 184,
    "air": 185,
    "unheated": 186,
    "warehouse": 187,
    "turned": 188,
    "sun": 189,
    "disappeared": 190,
    "behind": 191,
    "mountains": 192,
    "engaged": 193,
    "philosophical": 194,
    "debate": 195,
    "long": 196,
    "exploring": 197,
    "fundamental": 198,
    "questions": 199,
    "cave": 200,
    "system": 201,
    "experienced": 202,
    "guides": 203,
    "exploration": 204,
    "app": 205,
    "included": 206,
    "functionality": 207,
    "lacked": 208,
    "features": 209,
    "premium": 210,
    "alternatives": 211,
    "she": 212,
    "ecstatic": 213,
    "be": 214,
    "accepted": 215,
    "dream": 216,
    "university": 217,
    "program": 218,
    "hike": 219,
    "difficulty": 220,
    "challenging": 221,
    "accessible": 222,
    "most": 223,
    "people": 224,
    "news": 225,
    "balanced": 226,
    "perspective": 227,
    "controversial": 228,
    "issue": 229,
    "pleasure": 230,
    "walk": 231,
    "nature": 232,
    "restored": 233,
    "peace": 234,
    "mind": 235,
    "shivered": 236,
    "room": 237,
    "wishing": 238,
    "brought": 239,
    "sweater": 240,
    "created": 241,
    "intricate": 242,
    "patterns": 243,
    "lace": 244,
    "took": 245,
    "months": 246,
    "complete": 247,
    "legal": 248,
    "document": 249,
    "clauses": 250,
    "referenced": 251,
    "recursively": 252,
    "autumn": 253,
    "day": 254,
    "park": 255,
    "falling": 256,
    "always": 257,
    "gave": 258,
    "him": 259,
    "about": 260,
    "passing": 261,
    "time": 262,
    "looking": 263,
    "photographs": 264,
    "friends": 265,
    "who": 266,
    "drifted": 267,
    "away": 268,
    "over": 269,
    "dog": 270,
    "wagging": 271,
    "tail": 272,
    "showed": 273,
    "how": 274,
    "it": 275,
    "see": 276,
    "its": 277,
    "owner": 278,
    "return": 279,
    "work": 280,
    "remained": 281,
    "largely": 282,
    "theoretical": 283,
    "mathematical": 284,
    "models": 285,
    "rather": 286,
    "than": 287,
    "experiments": 288,
    "approach": 289,
    "focusing": 290,
    "solutions": 291,
    "assigning": 292,
    "blame": 293,
    "raised": 294,
    "consciousness": 295,
    "software": 296,
    "architecture": 297,
    "made": 298,
    "modifications": 299,
    "risky": 300,
    "watch": 301,
    "contained": 302,
    "gears": 303,
    "mechanisms": 304,
    "assembled": 305,
    "by": 306,
    "skilled": 307,
    "craftsmen": 308,
    "documentary": 309,
    "examined": 310,
    "implications": 311,
    "new": 312,
    "technologies": 313,
    "soup": 314,
    "still": 315,
    "hot": 316,
    "steam": 317,
    "rising": 318,
    "bowl": 319,
    "research": 320,
    "focused": 321,
    "atomic": 322,
    "interactions": 323,
    "occur": 324,
    "scales": 325,
    "impossible": 326,
    "observe": 327,
    "directly": 328,
    "preferred": 329,
    "concrete": 330,
    "examples": 331,
    "theories": 332,
    "explain": 333,
    "concept": 334,
    "when": 335,
    "won": 336,
    "championship": 337,
    "final": 338,
    "seconds": 339,
    "game": 340,
    "metal": 341,
    "touch": 342,
    "direct": 343,
    "sunlight": 344,
    "all": 345,
    "structure": 346,
    "material": 347,
    "unexpected": 348,
    "properties": 349,
    "museum": 350,
    "allowed": 351,
    "visitors": 352,
    "have": 353,
    "experiences": 354,
    "historical": 355,
    "artifacts": 356,
    "arctic": 357,
    "wind": 358,
    "freezing": 359,
    "conditions": 360,
    "exposed": 361,
    "painful": 362,
    "within": 363,
    "witness": 364,
    "evidence": 365,
    "contradicted": 366,
    "defendant": 367,
    "story": 368,
    "emphasized": 369,
    "skills": 370,
    "students": 371,
    "could": 372,
    "apply": 373,
    "immediately": 374,
    "abandoned": 375,
    "puppy": 376,
    "eyes": 377,
    "looked": 378,
    "huddled": 379,
    "corner": 380,
    "cage": 381,
    "destruction": 382,
    "hometown": 383,
    "filled": 384,
    "what": 385,
    "lost": 386,
    "forever": 387,
    "delivered": 388,
    "benefits": 389,
    "community": 390,
    "first": 391,
    "year": 392,
    "receive": 393,
    "letter": 394,
    "old": 395,
    "friend": 396,
    "searching": 397,
    "collector": 398,
    "finally": 399,
    "find": 400,
    "rare": 401,
    "edition": 402,
    "understanding": 403,
    "theory": 404,
    "essential": 405,
    "continuing": 406,
    "physics": 407,
    "desert": 408,
    "dry": 409,
    "shimmering": 410,
    "above": 411,
    "sand": 412,
    "found": 413,
    "grasp": 414,
    "such": 415,
    "chef": 416,
    "menu": 417,
    "flavors": 418,
    "complemented": 419,
    "solution": 420,
    "yet": 421,
    "been": 422,
    "real": 423,
    "world": 424,
    "building": 425,
    "fully": 426,
    "engulfed": 427,
    "flames": 428,
    "bright": 429,
    "against": 430,
    "sky": 431,
    "streamed": 432,
    "window": 433,
    "creating": 434,
    "pools": 435,
    "floor": 436,
    "sought": 437,
    "shade": 438,
    "escape": 439,
    "temperatures": 440,
    "afternoon": 441,
    "spy": 442,
    "an": 443,
    "plot": 444,
    "connections": 445,
    "between": 446,
    "characters": 447,
    "music": 448,
    "violin": 449,
    "solo": 450,
    "tears": 451,
    "several": 452,
    "audience": 453,
    "members": 454,
    "explanations": 455,
    "convoluted": 456,
    "receiving": 457,
    "terminal": 458,
    "diagnosis": 459,
    "sank": 460,
    "unable": 461,
    "any": 462,
    "future": 463,
    "scientist": 464,
    "maintained": 465,
    "neutral": 466,
    "expression": 467,
    "while": 468,
    "presenting": 469,
    "findings": 470,
    "cat": 471,
    "curled": 472,
    "up": 473,
    "sunny": 474,
    "windowsill": 475,
    "water": 476,
    "mountain": 477,
    "lake": 478,
    "numbed": 479,
    "limbs": 480,
    "almost": 481,
    "morning": 482,
    "required": 483,
    "layers": 484,
    "clothing": 485,
    "stay": 486,
    "comfortable": 487,
    "philosopher": 488,
    "spoke": 489,
    "terms": 490,
    "justice": 491,
    "freedom": 492,
    "immune": 493,
    "is": 494,
    "network": 495,
    "cells": 496,
    "signals": 497,
    "working": 498,
    "concert": 499,
    "spring": 500,
    "kept": 501,
    "voice": 502,
    "discussing": 503,
    "sensitive": 504,
    "political": 505,
    "topic": 506,
    "writing": 507,
    "stance": 508,
    "facts": 509,
    "obvious": 510,
    "bias": 511,
    "company": 512,
    "results": 513,
    "measured": 514,
    "quantified": 515,
    "parenting": 516,
    "providing": 517,
    "both": 518,
    "paper": 519,
    "proposed": 520,
    "ideas": 521,
    "might": 522,
    "testable": 523,
    "decades": 524,
    "weather": 525,
    "jacket": 526,
    "temperature": 527,
    "dropped": 528,
    "overnight": 529,
    "covering": 530,
    "everything": 531,
    "layer": 532,
    "frost": 533,
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3
  },
  "idx_to_word": {
    "4": "her",
    "5": "hands",
    "6": "felt",
    "7": "warm",
    "8": "wrapped",
    "9": "around",
    "10": "the",
    "11": "mug",
    "12": "of",
    "13": "freshly",
    "14": "brewed",
    "15": "coffee",
    "16": "elderly",
    "17": "couple",
    "18": "seemed",
    "19": "content",
    "20": "sitting",
    "21": "together",
    "22": "not",
    "23": "needing",
    "24": "to",
    "25": "speak",
    "26": "recipe",
    "27": "was",
    "28": "simple",
    "29": "requiring",
    "30": "only",
    "31": "five",
    "32": "common",
    "33": "ingredients",
    "34": "their",
    "35": "shelter",
    "36": "provided",
    "37": "basic",
    "38": "protection",
    "39": "from",
    "40": "elements",
    "41": "but",
    "42": "little",
    "43": "comfort",
    "44": "he",
    "45": "wanted",
    "46": "something",
    "47": "tangible",
    "48": "remember",
    "49": "his",
    "50": "journey",
    "51": "just",
    "52": "digital",
    "53": "photos",
    "54": "offered",
    "55": "practical",
    "56": "advice",
    "57": "based",
    "58": "on",
    "59": "years",
    "60": "experience",
    "61": "in",
    "62": "field",
    "63": "a",
    "64": "cool",
    "65": "breeze",
    "66": "rustled",
    "67": "leaves",
    "68": "as",
    "69": "they",
    "70": "sat",
    "71": "porch",
    "72": "empty",
    "73": "playground",
    "74": "had",
    "75": "melancholy",
    "76": "atmosphere",
    "77": "fading",
    "78": "evening",
    "79": "light",
    "80": "despair",
    "81": "overwhelmed",
    "82": "refugees",
    "83": "faced",
    "84": "another",
    "85": "winter",
    "86": "without",
    "87": "adequate",
    "88": "movie",
    "89": "s",
    "90": "ending",
    "91": "left",
    "92": "everyone",
    "93": "theater",
    "94": "feeling",
    "95": "sad",
    "96": "and",
    "97": "reflective",
    "98": "project",
    "99": "moderate",
    "100": "complexity",
    "101": "team",
    "102": "specialists",
    "103": "novel",
    "104": "presented",
    "105": "complex",
    "106": "narrative",
    "107": "with",
    "108": "multiple",
    "109": "timelines",
    "110": "perspectives",
    "111": "children",
    "112": "were",
    "113": "happy",
    "114": "laughing",
    "115": "chased",
    "116": "each",
    "117": "other",
    "118": "through",
    "119": "sprinklers",
    "120": "painting",
    "121": "used",
    "122": "abstract",
    "123": "shapes",
    "124": "colors",
    "125": "evoke",
    "126": "emotional",
    "127": "responses",
    "128": "exam",
    "129": "tested",
    "130": "knowledge",
    "131": "subject",
    "132": "neither",
    "133": "too",
    "134": "easy",
    "135": "nor",
    "136": "difficult",
    "137": "mild",
    "138": "summer",
    "139": "perfect",
    "140": "for",
    "141": "dining",
    "142": "outside",
    "143": "course",
    "144": "covered",
    "145": "concepts",
    "146": "that",
    "147": "would",
    "148": "form",
    "149": "foundation",
    "150": "advanced",
    "151": "studies",
    "152": "ancient",
    "153": "city",
    "154": "labyrinthine",
    "155": "streets",
    "156": "confused",
    "157": "even",
    "158": "longtime",
    "159": "residents",
    "160": "skin",
    "161": "burning",
    "162": "after",
    "163": "many",
    "164": "hours",
    "165": "at",
    "166": "beach",
    "167": "sunscreen",
    "168": "hard",
    "169": "climb",
    "170": "summit",
    "171": "enjoying",
    "172": "view",
    "173": "gathered",
    "174": "fireplace",
    "175": "sharing",
    "176": "stories",
    "177": "late",
    "178": "into",
    "179": "night",
    "180": "breath",
    "181": "formed",
    "182": "visible",
    "183": "clouds",
    "184": "cold",
    "185": "air",
    "186": "unheated",
    "187": "warehouse",
    "188": "turned",
    "189": "sun",
    "190": "disappeared",
    "191": "behind",
    "192": "mountains",
    "193": "engaged",
    "194": "philosophical",
    "195": "debate",
    "196": "long",
    "197": "exploring",
    "198": "fundamental",
    "199": "questions",
    "200": "cave",
    "201": "system",
    "202": "experienced",
    "203": "guides",
    "204": "exploration",
    "205": "app",
    "206": "included",
    "207": "functionality",
    "208": "lacked",
    "209": "features",
    "210": "premium",
    "211": "alternatives",
    "212": "she",
    "213": "ecstatic",
    "214": "be",
    "215": "accepted",
    "216": "dream",
    "217": "university",
    "218": "program",
    "219": "hike",
    "220": "difficulty",
    "221": "challenging",
    "222": "accessible",
    "223": "most",
    "224": "people",
    "225": "news",
    "226": "balanced",
    "227": "perspective",
    "228": "controversial",
    "229": "issue",
    "230": "pleasure",
    "231": "walk",
    "232": "nature",
    "233": "restored",
    "234": "peace",
    "235": "mind",
    "236": "shivered",
    "237": "room",
    "238": "wishing",
    "239": "brought",
    "240": "sweater",
    "241": "created",
    "242": "intricate",
    "243": "patterns",
    "244": "lace",
    "245": "took",
    "246": "months",
    "247": "complete",
    "248": "legal",
    "249": "document",
    "250": "clauses",
    "251": "referenced",
    "252": "recursively",
    "253": "autumn",
    "254": "day",
    "255": "park",
    "256": "falling",
    "257": "always",
    "258": "gave",
    "259": "him",
    "260": "about",
    "261": "passing",
    "262": "time",
    "263": "looking",
    "264": "photographs",
    "265": "friends",
    "266": "who",
    "267": "drifted",
    "268": "away",
    "269": "over",
    "270": "dog",
    "271": "wagging",
    "272": "tail",
    "273": "showed",
    "274": "how",
    "275": "it",
    "276": "see",
    "277": "its",
    "278": "owner",
    "279": "return",
    "280": "work",
    "281": "remained",
    "282": "largely",
    "283": "theoretical",
    "284": "mathematical",
    "285": "models",
    "286": "rather",
    "287": "than",
    "288": "experiments",
    "289": "approach",
    "290": "focusing",
    "291": "solutions",
    "292": "assigning",
    "293": "blame",
    "294": "raised",
    "295": "consciousness",
    "296": "software",
    "297": "architecture",
    "298": "made",
    "299": "modifications",
    "300": "risky",
    "301": "watch",
    "302": "contained",
    "303": "gears",
    "304": "mechanisms",
    "305": "assembled",
    "306": "by",
    "307": "skilled",
    "308": "craftsmen",
    "309": "documentary",
    "310": "examined",
    "311": "implications",
    "312": "new",
    "313": "technologies",
    "314": "soup",
    "315": "still",
    "316": "hot",
    "317": "steam",
    "318": "rising",
    "319": "bowl",
    "320": "research",
    "321": "focused",
    "322": "atomic",
    "323": "interactions",
    "324": "occur",
    "325": "scales",
    "326": "impossible",
    "327": "observe",
    "328": "directly",
    "329": "preferred",
    "330": "concrete",
    "331": "examples",
    "332": "theories",
    "333": "explain",
    "334": "concept",
    "335": "when",
    "336": "won",
    "337": "championship",
    "338": "final",
    "339": "seconds",
    "340": "game",
    "341": "metal",
    "342": "touch",
    "343": "direct",
    "344": "sunlight",
    "345": "all",
    "346": "structure",
    "347": "material",
    "348": "unexpected",
    "349": "properties",
    "350": "museum",
    "351": "allowed",
    "352": "visitors",
    "353": "have",
    "354": "experiences",
    "355": "historical",
    "356": "artifacts",
    "357": "arctic",
    "358": "wind",
    "359": "freezing",
    "360": "conditions",
    "361": "exposed",
    "362": "painful",
    "363": "within",
    "364": "witness",
    "365": "evidence",
    "366": "contradicted",
    "367": "defendant",
    "368": "story",
    "369": "emphasized",
    "370": "skills",
    "371": "students",
    "372": "could",
    "373": "apply",
    "374": "immediately",
    "375": "abandoned",
    "376": "puppy",
    "377": "eyes",
    "378": "looked",
    "379": "huddled",
    "380": "corner",
    "381": "cage",
    "382": "destruction",
    "383": "hometown",
    "384": "filled",
    "385": "what",
    "386": "lost",
    "387": "forever",
    "388": "delivered",
    "389": "benefits",
    "390": "community",
    "391": "first",
    "392": "year",
    "393": "receive",
    "394": "letter",
    "395": "old",
    "396": "friend",
    "397": "searching",
    "398": "collector",
    "399": "finally",
    "400": "find",
    "401": "rare",
    "402": "edition",
    "403": "understanding",
    "404": "theory",
    "405": "essential",
    "406": "continuing",
    "407": "physics",
    "408": "desert",
    "409": "dry",
    "410": "shimmering",
    "411": "above",
    "412": "sand",
    "413": "found",
    "414": "grasp",
    "415": "such",
    "416": "chef",
    "417": "menu",
    "418": "flavors",
    "419": "complemented",
    "420": "solution",
    "421": "yet",
    "422": "been",
    "423": "real",
    "424": "world",
    "425": "building",
    "426": "fully",
    "427": "engulfed",
    "428": "flames",
    "429": "bright",
    "430": "against",
    "431": "sky",
    "432": "streamed",
    "433": "window",
    "434": "creating",
    "435": "pools",
    "436": "floor",
    "437": "sought",
    "438": "shade",
    "439": "escape",
    "440": "temperatures",
    "441": "afternoon",
    "442": "spy",
    "443": "an",
    "444": "plot",
    "445": "connections",
    "446": "between",
    "447": "characters",
    "448": "music",
    "449": "violin",
    "450": "solo",
    "451": "tears",
    "452": "several",
    "453": "audience",
    "454": "members",
    "455": "explanations",
    "456": "convoluted",
    "457": "receiving",
    "458": "terminal",
    "459": "diagnosis",
    "460": "sank",
    "461": "unable",
    "462": "any",
    "463": "future",
    "464": "scientist",
    "465": "maintained",
    "466": "neutral",
    "467": "expression",
    "468": "while",
    "469": "presenting",
    "470": "findings",
    "471": "cat",
    "472": "curled",
    "473": "up",
    "474": "sunny",
    "475": "windowsill",
    "476": "water",
    "477": "mountain",
    "478": "lake",
    "479": "numbed",
    "480": "limbs",
    "481": "almost",
    "482": "morning",
    "483": "required",
    "484": "layers",
    "485": "clothing",
    "486": "stay",
    "487": "comfortable",
    "488": "philosopher",
    "489": "spoke",
    "490": "terms",
    "491": "justice",
    "492": "freedom",
    "493": "immune",
    "494": "is",
    "495": "network",
    "496": "cells",
    "497": "signals",
    "498": "working",
    "499": "concert",
    "500": "spring",
    "501": "kept",
    "502": "voice",
    "503": "discussing",
    "504": "sensitive",
    "505": "political",
    "506": "topic",
    "507": "writing",
    "508": "stance",
    "509": "facts",
    "510": "obvious",
    "511": "bias",
    "512": "company",
    "513": "results",
    "514": "measured",
    "515": "quantified",
    "516": "parenting",
    "517": "providing",
    "518": "both",
    "519": "paper",
    "520": "proposed",
    "521": "ideas",
    "522": "might",
    "523": "testable",
    "524": "decades",
    "525": "weather",
    "526": "jacket",
    "527": "temperature",
    "528": "dropped",
    "529": "overnight",
    "530": "covering",
    "531": "everything",
    "532": "layer",
    "533": "frost",
    "0": "<pad>",
    "1": "<unk>",
    "2": "<bos>",
    "3": "<eos>"
  },
  "special_tokens": {
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3
  },
  "vocab_size": 534
}